# Analyze Data With SQL In Jupyter Notebook
## RPA Customer Segmentation | practice writing basic SQL queries | CodeAcademy

In [43]:
import pandas as pd
import numpy as np
import sqlite3 as sql

open CSV file in pandas dataframe

In [42]:
users_db = pd.read_csv('RPA_customersegmentation_data.csv')
users_db.head(5)

   id                  email campaign test  created_at    birthday
0   1    gchesshire0@ucoz.ru      NaN  NaN  2017-01-26  1982-04-17
1   2        rbritner1@is.gd      NaN  NaN  2017-10-08  1970-01-16
2   3  acoysh2@canalblog.com      NaN  NaN  2017-09-05  1986-08-11
3   4     rbasley3@google.cn      NaN  NaN  2017-07-29  1960-08-29
4   5      kdury4@elpais.com      NaN  NaN  2017-05-28  1988-10-02

### install the ipythons-sql library
This librabry will enable you to run sql in jupyer using jupyter magic commands

!pip install ipython-sql

### Use sqlite3 module and create a connection to pandas df 
### Convert SQLite database to Pandas dataframe with the Pandas df_to_sql() method

In [60]:
#Instantiate a connection
connection = sql.connect('users_db')

#Instantiate a cursor
cursor = connection.cursor()

#Create a table
df.to_sql('users', connection)

ValueError: Table 'users' already exists.

### Load the sql module to ipython

In [61]:
%reload_ext sql

In [28]:
%sql sqlite:///users_db

### Run sql queries

In [62]:
%%sql 
SELECT * 
FROM users
LIMIT 5

 * sqlite:///users_db
Done.

[(0, 1, 'gchesshire0@ucoz.ru', None, None, '2017-01-26', '1982-04-17'),
 (1, 2, 'rbritner1@is.gd', None, None, '2017-10-08', '1970-01-16'),
 (2, 3, 'acoysh2@canalblog.com', None, None, '2017-09-05', '1986-08-11'),
 (3, 4, 'rbasley3@google.cn', None, None, '2017-07-29', '1960-08-29'),
 (4, 5, 'kdury4@elpais.com', None, None, '2017-05-28', '1988-10-02')]

 **4-Find the emails of the users who received the ‘bears’ test.**

In [32]:
%%sql 
SELECT * 
FROM users 
WHERE test = 'bears'
LIMIT 5

 * sqlite:///users_db
Done.

[(7, 8, 'tdurden7@usgs.gov', None, 'bears', '2017-04-09', '1989-08-12'),
 (9, 10, 'styndall9@vimeo.com', None, 'bears', '2017-11-05', '1976-01-20'),
 (11, 12, 'hhandmanb@macromedia.com', None, 'bears', '2017-05-29', '1963-10-24'),
 (30, 31, 'bnoadsu@howstuffworks.com', None, 'bears', '2017-04-29', '1967-08-11'),
 (39, 40, 'sirving13@php.net', None, 'bears', '2017-06-10', '1987-09-03')]

**5--Find all the emails of all users who received a campaign on website BBB.**

In [34]:
%%sql

SELECT email, campaign
FROM users 
WHERE campaign LIKE 'B%'
LIMIT 5

 * sqlite:///users_db
Done.

[('egashion1j@angelfire.com', 'BBB-2'),
 ('jfawley22@zdnet.com', 'BBB-1'),
 ('wstruijs2k@kickstarter.com', 'BBB-2'),
 ('gtetlow3c@jimdo.com', 'BBB-1'),
 ('csmogur3q@sbwire.com', 'BBB-2')]

**6 -- Find all the emails of all users who received ad copy 2 in their campaign.**

In [35]:
%%sql 
SELECT email,campaign, test
FROM users 
WHERE campaign LIKE '%-2'
LIMIT 5

 * sqlite:///users_db
Done.

[('egashion1j@angelfire.com', 'BBB-2', None),
 ('wstruijs2k@kickstarter.com', 'BBB-2', None),
 ('csmogur3q@sbwire.com', 'BBB-2', 'lions'),
 ('jgleader3u@imageshack.us', 'BBB-2', None),
 ('dshuttleworth41@reference.com', 'BBB-2', None)]

**7 -- Find the emails for all users who received both a campaign and a test.
These users will have non-empty entries in the  campaign and test columns.**

In [63]:
%%sql 

SELECT email,campaign, test
FROM users 
WHERE campaign IS NOT NULL 
AND test IS NOT NULL
LIMIT 5

 * sqlite:///users_db
Done.

[('csmogur3q@sbwire.com', 'BBB-2', 'lions'),
 ('rpressman7g@1und1.de', 'BBB-1', 'lions'),
 ('sivan8t@constantcontact.com', 'BBB-2', 'bears'),
 ('teamerb7@cbslocal.com', 'BBB-1', 'bears'),
 ('ckauffmandj@w3.org', 'BBB-1', 'bears')]

**8
-- Challenge
-- One of the members of the marketing team had an idea of calculating
-- how old users were when they signed up.**

In [67]:
SELECT * (created_at - birthday) as age_on_signup 
FROM users
ORDER BY age_on_signup ASC
LIMIT 5

SyntaxError: invalid syntax (<ipython-input-67-8f7f7fb13dd6>, line 1)